load-tests/artillery/auth-flow-simple.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 2
      name: "Simple load test"
    - duration: 30
      arrivalRate: 5
      name: "Sustained load"
  plugins:
    expect: {}
    metrics-by-endpoint: {}
  ensure:
    maxErrorRate: 1  # Max 1% error rate
    p95: 500         # 95th percentile response time < 500ms
    p99: 1000        # 99th percentile response time < 1000ms

scenarios:
  - name: "User Login Test"
    weight: 1
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "admin@test.com"
            password: "TestPassword123!"
          capture:
            - json: "$.token"
              as: "authToken"
            - json: "$.user.uid"
              as: "userId"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: token
      - think: 1
      - get:
          url: "/api/auth/profile"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
            - contentType: json
      - think: 2

  - name: "User Registration Test"
    weight: 1
    flow:
      - post:
          url: "/api/auth/register"
          json:
            email: "{{ $randomString() }}@loadtest.com"
            password: "LoadTest123!"
            displayName: "Load Test User {{ $randomNumber(1, 10000) }}"
          expect:
            - statusCode: 201
            - contentType: json
      - think: 2